000_РОЗНИЦА_ЦЕНТР/src/ExchangePlans/ОбменMicrosoftDynamics/ОбменMicrosoftDynamics.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="89ee3d9c-2568-4236-959b-652c90e52d3e">
  <name>ОбменMicrosoftDynamics</name>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОбратный</name>
    <comment>Определяет порядок по дате документов - прямой или обратный</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Процедура</name>
    <comment>Имя процедуры внешнего ресурса</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьИзменения</name>
    <comment>Выполнять регистрацию объектов перед записью.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.ТипыРегистрацийMicrosoftDynamics</types>
    </type>
  </attributes>
</mdclass:ExchangePlan>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/СтруктураУзлов/СтруктураУзлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураУзлов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>MSDyn_CRM</name>
      <description>MS Dynamics CRM</description>
    </items>
    <items>
      <name>КСУ_Navision</name>
      <description>Корпоративная Система Управления (внешний источник Navision)</description>
    </items>
    <items>
      <name>ЦентральныйОфис</name>
      <description>ЦЕНТРАЛЬНЫЙ ОФИС</description>
    </items>
  </predefined>
  <attributes>
    <name>Account</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BaseName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Password</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServerAddress</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияОС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидУзла</name>
    <type>
      <types>EnumRef.ВидыУзлов</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогФайловОбновления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогФайловРезервныхКопий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПрограммы</name>
    <type>
      <types>EnumRef.ПрограммаМобильногоУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧрезвычайноеПоложение</name>
    <comment>Вне доступа из-за войны</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Алгоритмы</name>
    <attributes>
      <name>Алгоритм</name>
      <comment>Алгоритм, назначенный для выполнения в текущем узле</comment>
      <type>
        <types>CatalogRef.Алгоритмы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыполнятьАлгоритм</name>
      <type>
        <types>EnumRef.ВыполнятьАлгоритм</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Магазины</name>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроизвольныеДанные</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Данные</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезервныеКопии</name>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСоздания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СетевыеИнтерфейсы</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/ExchangePlans/ОбменMicrosoftDynamics/ManagerModule.bsl
//	LNK 03.12.2019 09:33:16
Функция ПолучитьДанныеУзла(УзелИнформационнойБазы)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Запрос	= Новый Запрос(
	"ВЫБРАТЬ
	|	""ОбменMicrosoftDynamics"" КАК Имя,
	|	ТаблицаУзлов.Ссылка КАК Узел,
	|	ТаблицаУзлов.Код КАК Код,
	|	ТаблицаУзлов.Наименование КАК Наименование,
	|	ТаблицаУзлов.ПометкаУдаления КАК ПометкаУдаления,
	|	ТаблицаУзлов.НомерОтправленного КАК НомерОтправленного,
	|	ТаблицаУзлов.НомерПринятого КАК НомерПринятого,
	|	ТаблицаУзлов.Магазин КАК Магазин,
	|	ТаблицаУзлов.ПорядокОбратный КАК ПорядокОбратный,
	|	ТаблицаУзлов.РегистрироватьИзменения КАК РегистрироватьИзменения,
	|	ТаблицаУзлов.ТипРегистрации КАК ТипРегистрации,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураУзлов.MSDyn_CRM) КАК ЭлементСтруктуры
	|ИЗ
	|	ПланОбмена.ОбменMicrosoftDynamics КАК ТаблицаУзлов
	|ГДЕ
	|	ТаблицаУзлов.Ссылка = &ТекущийУзел"
	);
	Запрос.УстановитьПараметр("ТекущийУзел", УзелИнформационнойБазы);

	Результат = Запрос.Выполнить();

	ДанныеУзла = Новый Структура;

	Для каждого Колонка Из Результат.Колонки Цикл

		ДанныеУзла.Вставить(Колонка.Имя, Колонка.ТипЗначения.ПривестиЗначение());

	КонецЦикла;

	Выборка = Результат.Выбрать();

	Если Выборка.Следующий() Тогда

		ЗаполнитьЗначенияСвойств(ДанныеУзла, Выборка);

		Для каждого Колонка Из Результат.Колонки Цикл

			Если Колонка.ТипЗначения.СодержитТип(Тип("РезультатЗапроса")) Тогда

				ДанныеУзла[Колонка.Имя] = Выборка[Колонка.Имя].Выгрузить();

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;
	
	Возврат ДанныеУзла;

КонецФункции

//	LNK 08.06.2022 08:40:22
Функция ПрименитьОбъектПриКоллизииИзменений(УзелИнформационнойБазы, Объект)	Экспорт

	Возврат Истина;

КонецФункции
